PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p18lf8722.inc
;----- CONFIG1H Options --------------------------------------------------
_OSC_LP_1H           EQU  H'F0'; LP oscillator
_OSC_XT_1H           EQU  H'F1'; XT oscillator
_OSC_HS_1H           EQU  H'F2'; HS oscillator
_OSC_RC_1H           EQU  H'F3'; External RC oscillator, CLKO function on RA6
_OSC_EC_1H           EQU  H'F4'; EC oscillator, CLKO function on RA6
_OSC_ECIO6_1H        EQU  H'F5'; EC oscillator, port function on RA6
_OSC_HSPLL_1H        EQU  H'F6'; HS oscillator, PLL enabled (Clock Frequency = 4 x FOSC1)
_OSC_RCIO6_1H        EQU  H'F7'; External RC oscillator, port function on RA6
_OSC_INTIO67_1H      EQU  H'F8'; Internal oscillator block, port function on RA6 and RA7
_OSC_INTIO7_1H       EQU  H'F9'; Internal oscillator block, CLKO function on RA6, port function on RA7

_FCMEN_OFF_1H        EQU  H'BF'; Fail-Safe Clock Monitor disabled
_FCMEN_ON_1H         EQU  H'FF'; Fail-Safe Clock Monitor enabled

_IESO_OFF_1H         EQU  H'7F'; Two-Speed Start-up disabled
_IESO_ON_1H          EQU  H'FF'; Two-Speed Start-up enabled

;----- CONFIG2L Options --------------------------------------------------
_PWRT_ON_2L          EQU  H'FE'; PWRT enabled
_PWRT_OFF_2L         EQU  H'FF'; PWRT disabled

_BOREN_OFF_2L        EQU  H'F9'; Brown-out Reset disabled in hardware and software
_BOREN_ON_2L         EQU  H'FB'; Brown-out Reset enabled and controlled by software (SBOREN is enabled)
_BOREN_NOSLP_2L      EQU  H'FD'; Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled)
_BOREN_SBORDIS_2L    EQU  H'FF'; Brown-out Reset enabled in hardware only (SBOREN is disabled)

_BORV_0_2L           EQU  H'E7'; Maximum setting
_BORV_1_2L           EQU  H'EF'
_BORV_2_2L           EQU  H'F7'
_BORV_3_2L           EQU  H'FF'; Minimum setting

;----- CONFIG2H Options --------------------------------------------------
_WDT_OFF_2H          EQU  H'FE'; WDT disabled (control is placed on the SWDTEN bit)
_WDT_ON_2H           EQU  H'FF'; WDT enabled

_WDTPS_1_2H          EQU  H'E1'; 1:1
_WDTPS_2_2H          EQU  H'E3'; 1:2
_WDTPS_4_2H          EQU  H'E5'; 1:4
_WDTPS_8_2H          EQU  H'E7'; 1:8
_WDTPS_16_2H         EQU  H'E9'; 1:16
_WDTPS_32_2H         EQU  H'EB'; 1:32
_WDTPS_64_2H         EQU  H'ED'; 1:64
_WDTPS_128_2H        EQU  H'EF'; 1:128
_WDTPS_256_2H        EQU  H'F1'; 1:256
_WDTPS_512_2H        EQU  H'F3'; 1:512
_WDTPS_1024_2H       EQU  H'F5'; 1:1024
_WDTPS_2048_2H       EQU  H'F7'; 1:2048
_WDTPS_4096_2H       EQU  H'F9'; 1:4096
_WDTPS_8192_2H       EQU  H'FB'; 1:8192
_WDTPS_16384_2H      EQU  H'FD'; 1:16384
_WDTPS_32768_2H      EQU  H'FF'; 1:32768

;----- CONFIG3L Options --------------------------------------------------
_MODE_EM_3L          EQU  H'FC'; Extended Microcontroller mode
_MODE_MPB_3L         EQU  H'FD'; Microprocessor with Boot Block mode
_MODE_MP_3L          EQU  H'FE'; Microprocessor mode
_MODE_MC_3L          EQU  H'FF'; Microcontroller mode

_ADDRBW_ADDR8BIT_3L  EQU  H'CF'; 8-bit Address Bus
_ADDRBW_ADDR12BIT_3L EQU  H'DF'; 12-bit Address Bus
_ADDRBW_ADDR16BIT_3L EQU  H'EF'; 16-bit Address Bus
_ADDRBW_ADDR20BIT_3L EQU  H'FF'; 20-bit Address Bus

_DATABW_DATA8BIT_3L  EQU  H'BF'; 8-bit External Bus mode
_DATABW_DATA16BIT_3L EQU  H'FF'; 16-bit External Bus mode

_WAIT_ON_3L          EQU  H'7F'; Wait selections for table reads and table writes are determined by the WAIT1:WAIT0 bits
_WAIT_OFF_3L         EQU  H'FF'; Wait selections are unavailable for table reads and table writes

;----- CONFIG3H Options --------------------------------------------------
_CCP2MX_PORTBE_3H    EQU  H'FE'; ECCP2 is multiplexed with RB3 in Extended Microcontroller, Microprocessor or Microprocessor with Boot Block mode. Or with RE7 in Microcontroller mode.
_CCP2MX_PORTC_3H     EQU  H'FF'; ECCP2 input/output is multiplexed with RC1

_ECCPMX_PORTH_3H     EQU  H'FD'; ECCP1/3 (P1B/P1C/P3B/P3C) are multiplexed onto RH7, RH6, RH5 and RH4 respectively
_ECCPMX_PORTE_3H     EQU  H'FF'; ECCP1/3 (P1B/P1C/P3B/P3C) are multiplexed onto RE6, RE5, RE4 and RE3 respectively

_LPT1OSC_OFF_3H      EQU  H'FB'; Timer1 configured for higher power operation
_LPT1OSC_ON_3H       EQU  H'FF'; Timer1 configured for low-power operation

_MCLRE_OFF_3H        EQU  H'7F'; RG5 input pin enabled; MCLR disabled
_MCLRE_ON_3H         EQU  H'FF'; MCLR pin enabled; RG5 input pin disabled

;----- CONFIG4L Options --------------------------------------------------
_STVREN_OFF_4L       EQU  H'FE'; Stack full/underflow will not cause Reset
_STVREN_ON_4L        EQU  H'FF'; Stack full/underflow will cause Reset

_LVP_OFF_4L          EQU  H'FB'; Single-Supply ICSP disabled
_LVP_ON_4L           EQU  H'FF'; Single-Supply ICSP enabled

_BBSIZ_BB2K_4L       EQU  H'CF'; 1K word (2 Kbytes) Boot Block size
_BBSIZ_BB4K_4L       EQU  H'DF'; 2K words (4 Kbytes) Boot Block size
_BBSIZ_BB8K_4L       EQU  H'EF'; 4K words (8 Kbytes) Boot Block size

_XINST_OFF_4L        EQU  H'BF'; Instruction set extension and Indexed Addressing mode disabled (Legacy mode)
_XINST_ON_4L         EQU  H'FF'; Instruction set extension and Indexed Addressing mode enabled

_DEBUG_ON_4L         EQU  H'7F'; Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug
_DEBUG_OFF_4L        EQU  H'FF'; Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins

;----- CONFIG5L Options --------------------------------------------------
_CP0_ON_5L           EQU  H'FE'; Block 0 (000800, 001000 or 002000-003FFFh) code-protected
_CP0_OFF_5L          EQU  H'FF'; Block 0 (000800, 001000 or 002000-003FFFh) not code-protected

_CP1_ON_5L           EQU  H'FD'; Block 1 (004000-007FFFh) code-protected
_CP1_OFF_5L          EQU  H'FF'; Block 1 (004000-007FFFh) not code-protected

_CP2_ON_5L           EQU  H'FB'; Block 2 (008000-00BFFFh) code-protected
_CP2_OFF_5L          EQU  H'FF'; Block 2 (008000-00BFFFh) not code-protected

_CP3_ON_5L           EQU  H'F7'; Block 3 (00C000-00FFFFh) code-protected
_CP3_OFF_5L          EQU  H'FF'; Block 3 (00C000-00FFFFh) not code-protected

_CP4_ON_5L           EQU  H'EF'; Block 4 (010000-013FFFh) code-protected
_CP4_OFF_5L          EQU  H'FF'; Block 4 (010000-013FFFh) not code-protected

